// console.log(products);

//1)console.log -ում տպել 150 -ից 350 բոլոր թվերը (օգտագերծել while ցիկլը );


// ________________________ task 1 Start

// let a = 150
// while (a <= 350) {
//     console.log(a);
//     a++
// }

// ________________________ task 1 End


// _____________________________________________________________________________________________________________________________

//2) console.log -ում տպել 150 -ից 350 բոլոր զույգ թվերը  (օգտագերծել for  ցիկլը );

// ________________________ task 2 Start

// for (let i = 150; i < 350; i++){
//     if (i % 2 == 0 ) {
//         console.log(i);
//     }

   
// }




// ________________________ task 2 End

// _____________________________________________________________________________________________________________________________


//3) console.log -ում տպել 150 -ից 350 բոլոր կենտ թվերը  (օգտագերծել for  ցիկլը );

// ________________________ task 3 Start


// for (let i = 150; i < 350; i++){
//     if (i % 2 != 0 ) {
//         console.log(i);
//     }

   
// }



// ________________________ task 3 End


// _____________________________________________________________________________________________________________________________

// 4) ստեղծել դատարկ զանգված arr1 անունով և 1-ից 100 բոլոր զույգ թվերը 
// (push ) մեթոդի օգնությումբ լցնել զանգավծի մեջ (օգտագործել ցիկլ)
// օր․ [2,4,6...]

// ________________________ task 4 Start


// let arr1 = []

// for (let i = 0; i <=  100; i++) {
//     if (i % 2 == 0 ) {
//         arr1.push(i)
//     }
    
// }




// ________________________ task 4 End

// _____________________________________________________________________________________________________________________________


//5) ստեղծել object որի առաջին դաշտը կունենա name1-key և "Max" - value 
// 2րդ դաշտը կունենա myArrOdd - key իսկ value - ն կլինի նախորդ խնդրի զանգվածը 
// տպել object - ի myArrOdd - զանգվածի վերջին թիվը


// ________________________ task 5 Start

// let arr1 = []

// for (let i = 0; i <=  100; i++) {
//     if (i % 2 == 0 ) {
//         arr1.push(i)
//     }
    
// }

// let obj = {
//     name1:"Max",
//     myArrOdd: arr1
// }

// console.log(obj.myArrOdd[arr1.length - 1]);

// ________________________ task 5 End


// _____________________________________________________________________________________________________________________________


// 6) arrayNumbers զանգվածից ցիկլի օգնությամբ գտնել բոլոր
// զույգ թվերը և տպել log - ում  

// let arrayNumbers = [2,4,5,9,8,2,3,6,5,7,8,4,1,2,];

// ________________________ task 6 Start

// let arrayNumbers = [2,4,5,9,8,2,3,6,5,7,8,4,1,2];

// for (let i = 0; i < arrayNumbers.length; i++) {
//     if (arrayNumbers[i] % 2 == 0) {
//         console.log(arrayNumbers[i]);
//     }
    
// }



// ________________________ task 6 End

// _____________________________________________________________________________________________________________________________


// 7) տպել զանգվածի մեջտեղի թիվը կամ թվերը ,
// եթե զանգվածը զույգ է մեջտեղի 2 թիվը օր․ [4,7,5,88] --> 7 և 5
// եթե կենտ միայն այդ մեջտեղի թիվը  օր [4,7,5] --> 7

// let arrayNumbers = [2,4,5,9,8,2,3,6,5,7,8,4,1,2];


// ________________________ task 7 Start


// let arrayNumbers = [2,4,5,9,8,2,3,6,5,7,8,4,1,2,3];

// if (arrayNumbers. length % 2 == 0) {
//     console.log(arrayNumbers[arrayNumbers.length / 2]  );
// }else{
//     console.log(arrayNumbers[ Math.floor(arrayNumbers.length / 2)] , arrayNumbers[ Math.ceil(arrayNumbers.length / 2)] );
// }




// ________________________ task 7 End

// _____________________________________________________________________________________________________________________________


//8)ստեղծել function որը alert - Է անում (Hello) 5 անգամ (օգտագործել ցիկլ)


// ________________________ task 8 Start



// function fun1() {
//     for (let i = 0; i < 5; i++) {
//         console.log("hello");
        
//     }
// }


// fun1()


// ________________________ task 8 End


// _____________________________________________________________________________________________________________________________

//9) ստեղծել arrow(սլաքով =>) function որը alert - Է անում (=>Arrow<=)  5 անգամ (օգտագործել ցիկլ)

// ________________________ task 9 Start


// ( ) => {
//     for (let i = 0; i < 5; i++) {
//         console.log("=>Arrow<=");
        
//     }
// } 


//??????????????????????????????????????????????????????????????????

// ________________________ task 9 End

// _____________________________________________________________________________________________________________________________


//10) Տպել console.log -ում այս պահի ժամը , րոպեն և վայրկայնը 
// թարմացնել ինֆորմացյան ամեն 1 վայկայանը մեկ 


// ________________________ task 10 Start

// setInterval(() =>{
//     let newDate = new Date()
//     console.log("" + newDate.getHours() + " " + newDate.getMinutes() + " " + newDate.getSeconds() );



// },1000)


// ________________________ task 10 End


// _____________________________________________________________________________________________________________________________

//11) ստեծել button որի վրա սեղմելուց alert-ում կտպի  (DOM)
// հուշում - createElement , innerHTML ,appendChild ,addEventListener

// ________________________ task 11 Start

// let btn = document.createElement("button")
// btn.innerHTML = "button"
// document.body.appendChild(btn)

// btn.addEventListener("click", ()=>{
//     alert("DOM")
// })
// ________________________ task 11 End

// _____________________________________________________________________________________________________________________________


//12) վերադարձնել նոր զանգված որը կպարունակի
// նախկին զանգվածի թվերի կրկնապատիկները (օգտագործել map)

// let arrayNumbers = [2,4,5,9,8,2,3,6,5,7,8,4,1,2];
// օր․ [4,8,10...]

// ________________________ task 12 Start

// let arrayNumbers = [2,4,5,9,8,2,3,6,5,7,8,4,1,2];
// let newArr = []
// arrayNumbers.map((a) => {
//     newArr.push(a * 2)
// })

// console.log(newArr);

// ________________________ task 12 End

// _____________________________________________________________________________________________________________________________


//13) գտնել այն տարերը որոնց տիպը number չէ և տպել  (օգտագործել forEach)

// let arrayNumbers = [2,4,5,9,"8",2,3,6,"t",7,8,4,1,2];

// ________________________ task 13 Start
// let arrayNumbers = [2,4,5,9,"8",2,3,6,"t",7,8,4,1,2];

// arrayNumbers.forEach((a) => {
//     if (typeof a != "number") {
//         console.log(a);
//     }
// })

// ________________________ task 13 End

// _____________________________________________________________________________________________________________________________














// 4) user - ից պահանջել որ գրի ապրանքի տեսակը և իր նախըտրած գինը վերադարձնել այդ գնի սահմանում կա համապատասխան ապրանք թե ոչ ;

// ______________________________________________________________

    fetch('https://dummyjson.com/products')
        .then(response => response.json())
        .then((obj)=>{
            let data = obj.products;
            let btn = document.getElementById("btn1")

            

            function htmlDiv(prod) {
                return (`
                    <div>
                                <img src="${prod.images[0]}" alt="" width="200px" height="200px">
                                <h1>${prod.brand}</h1>
                                <h2>${prod.price} $</h2>
                    </div>
                `)}


            function fun1(htmlDiv){

                btn.addEventListener("click" , ()=>{
                    let inp1 = document.getElementById("inp1").value
                    let inp2 = document.getElementById("inp2").value


                    let prod = data.filter((a)=>{

                        if (a.category == inp1 && a.price <= inp2) {
                            return a
                        }

                    })
                    
                    let div1 = document.createElement("div")
                    div1.setAttribute("id", "divv1") 
                    document.body.appendChild(div1)

                    prod.forEach((a) => {
                        
                        let div2 = document.createElement("div")
                        
                        div2.innerHTML = htmlDiv(a)
                        div2.style = `
                            width: 200px;
                            height: 350px;
                            margin: 20px;
                        `
                        
                        div1.appendChild(div2)

                    });
                    

                })
        }
        
            fun1(htmlDiv)
      })






// ___________________________________________________________________________________________________________            